#!/bin/bash
echo -e "\033[31m 准备倒数5秒!!! \033[0m"
#seq 用于生成从一个数到另一个数之间的所有整数
#用法：seq  选项...首数 尾数
#seq -f "%3g 13 " 数字位数为三位，不足补空格
#seq -f "%03g" 1 5 数字位数为三位，不足补零
for i in $(seq 5 -1 1)
do
        echo -en "$i\n"
        sleep 1
done


#echo显示内容带颜色显示-e
#红色
echo -e "\033[31m 开始!!! \033[0m"

#黄色
#echo -e "\033[34m 开始!!! \033[0m"

#红底黄字
#echo -e "\033[41;33m 开始!!! \033[0m"

#红底白字
#echo -e "\033[41;37m 开始!!! \033[0m"


#echo -e "\033[30m 黑色字 \033[0m"
#echo -e "\033[31m 红色字 \033[0m" 
#echo -e "\033[32m 绿色字 \033[0m" 
#echo -e "\033[33m 黄色字 \033[0m" 
#echo -e "\033[34m 蓝色字 \033[0m" 
#echo -e "\033[35m 紫色字 \033[0m" 
#echo -e "\033[36m 天蓝字 \033[0m" 
#echo -e "\033[37m 白色字 \033[0m" 
